## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # helm_release.cluster-issuer will be created
+   resource "helm_release" "cluster-issuer" {
+       atomic                     = false
+       chart                      = "../charts/cluster-issuer"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cluster-issuer"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.0.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "zerossl_eab_hmac_key"
+           value = "lvQC_f5Q2QQtTF0b32ko-G2ePa3hiYz2cajnbfe6hXLp1uVwHRubcZtf5k66_Qp3585V1L17rMWr5nF4MgSAQg"
        }
+       set {
+           name  = "zerossl_eab_hmac_key_id"
+           value = "lvQC_f5Q2QQtTF0b32ko-G2ePa3hiYz2cajnbfe6hXLp1uVwHRubcZtf5k66_Qp3585V1L17rMWr5nF4MgSAQg"
        }
+       set {
+           name  = "zerossl_email"
+           value = "service@contrasting.org"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
